In [ ]:
import pandas as pd

In [ ]:
PATH_FILE = "/content/sample_data/california_housing_train.csv"
df_house = pd.read_csv(PATH_FILE)

In [ ]:
type(df_house)

pandas.core.frame.DataFrame

In [ ]:
df_house.shape

(17000, 9)

In [ ]:
df_house.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [ ]:
df_house[0:5][["longitude", "median_income", 'population']]

   longitude  median_income  population
0    -114.31         1.4936      1015.0
1    -114.47         1.8200      1129.0
2    -114.56         1.6509       333.0
3    -114.57         3.1917       515.0
4    -114.57         1.9250       624.0

In [ ]:
df_house[df_house["population"] > 1000]

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
6        -114.58     33.61  ...         2.6768             82400.0
8        -114.59     33.61  ...         2.1782             58400.0
10       -114.60     33.62  ...         2.6797             86500.0
...          ...       ...  ...            ...                 ...
16991    -124.23     41.75  ...         2.4805             73200.0
16993    -124.23     40.54  ...         3.0806            106700.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0

[10299 rows x 9 columns]

In [ ]:
df_house[(df_house["population"] > 1000) & (df_house["total_rooms"] >= 5000)].shape

(1438, 9)

In [ ]:
df_house[(df_house["population"] > 1000) & (df_house["total_rooms"] == 5000)].shape

(0, 9)

In [ ]:
df_house[(df_house["population"] > 1000) & (df_house["total_rooms"] != 5000)].shape

(10299, 9)

In [ ]:
condition_1 = (df_house["population"] > 1000)
condition_2 = (df_house["total_rooms"] == 5000)
condition_3 = (df_house["households"] <= 500)

df_house[condition_1 & condition_2 & condition_3]

Empty DataFrame
Columns: [longitude, latitude, housing_median_age, total_rooms, total_bedrooms, population, households, median_income, median_house_value]
Index: []

In [ ]:
df_house[:3]

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0

[3 rows x 9 columns]

# Data Types
1. Numerical Data: 
2. Categorical Data:
3. Spatial Data:

In [ ]:
df_house.describe()

          longitude      latitude  ...  median_income  median_house_value
count  17000.000000  17000.000000  ...   17000.000000        17000.000000
mean    -119.562108     35.625225  ...       3.883578       207300.912353
std        2.005166      2.137340  ...       1.908157       115983.764387
min     -124.350000     32.540000  ...       0.499900        14999.000000
25%     -121.790000     33.930000  ...       2.566375       119400.000000
50%     -118.490000     34.250000  ...       3.544600       180400.000000
75%     -118.000000     37.720000  ...       4.767000       265000.000000
max     -114.310000     41.950000  ...      15.000100       500001.000000

[8 rows x 9 columns]

In [ ]:
len(df_house.columns)

9

In [ ]:
df_house["all_rooms"] = df_house["total_rooms"] + df_house["total_bedrooms"]

In [ ]:
df_house[:3]

   longitude  latitude  ...  median_house_value  all_rooms
0    -114.31     34.19  ...             66900.0     6895.0
1    -114.47     34.40  ...             80100.0     9551.0
2    -114.56     33.69  ...             85700.0      894.0

[3 rows x 10 columns]

In [ ]:
df_house["pop_dense"] = df_house["population"] / df_house["households"]

In [ ]:
df_house[["pop_dense", "population", "households"]][:3]

   pop_dense  population  households
0   2.150424      1015.0       472.0
1   2.438445      1129.0       463.0
2   2.846154       333.0       117.0

In [ ]:
df_house["house_price"] = df_house["median_house_value"] + (df_house["median_house_value"] * 0.2)

In [ ]:
df_house[["median_house_value", "house_price"]].sample(3)

       median_house_value  house_price
5143             351100.0     421320.0
3582             175000.0     210000.0
11826             84600.0     101520.0

In [ ]:
PATH_FILE_SAVE = "/content/sample_data/new_california_housing_train.csv"

In [ ]:
df_house.to_csv(PATH_FILE_SAVE)

In [ ]:
NEW_PATH_FILE = "/content/drive/My Drive/Pandas รอบที่ 5/app_luxe.xlsx"

In [ ]:
df_apps = pd.read_excel(NEW_PATH_FILE)

In [ ]:
df_apps[:3]

   Unnamed: 0                         Name  luxe_score
0        1378               Clash of Clans    5.305339
1        2634    Finabase: realtime stocks    4.861782
2       16085  Arcane Pets: Plushie Empire    4.333298

In [ ]:
PATH_URL = "https://www.settrade.com/C04_02_stock_historical_p1.jsp?txtSymbol=AU&ssoPageId=10&selectPage=2"
df_au = pd.read_html(PATH_URL)

In [ ]:
df_au[0].to_csv()

      วันที่  ราคาเปิด  ราคาสูงสุด  ...  มูลค่า(ล้านบาท)  SETIndex  %เปลี่ยนแปลง.1
0   13/05/20      8.50        8.80  ...            41.96   1294.55           -0.40
1   12/05/20      8.15        8.60  ...            46.67   1299.69            0.96
2   11/05/20      8.75        8.90  ...            35.02   1287.30            1.68
3   08/05/20      8.60        8.70  ...            16.83   1266.02            0.64
4   07/05/20      8.55        8.60  ...            41.45   1257.98           -1.62
5   05/05/20      8.80        8.80  ...            28.85   1278.63           -1.77
6   30/04/20      8.90        9.15  ...            65.34   1301.66            1.48
7   29/04/20      8.85        8.90  ...            34.62   1282.68            0.60
8   28/04/20      8.80        8.85  ...            34.16   1274.99            0.60
9   27/04/20      8.70        8.80  ...            34.29   1267.41            0.69
10  24/04/20      8.80        9.10  ...            74.26   1258.78           -1.08
11  23/04/20      9.05        9.05  ...            36.44   1272.53            0.85
12  22/04/20      8.90        8.90  ...            47.20   1261.81            0.71
13  21/04/20      8.65        9.05  ...           100.44   1252.92           -1.06
14  20/04/20      8.40        8.90  ...            85.75   1266.40            2.19

[15 rows x 12 columns]